print("Введите три аргумента по порядку a, b и c:")
a = float(input())
b = float(input())
c = float(input())
a1 = str(a)
b1 = str(b)
c1 = str(c)
if (a and b and c) != 0:
  print("Ваше уравнение аыглядит так:")
  print(a1+"*x² + "+b1+"*x + "+c1+" = 0")
  D = (b**2 - 4*a*c)
  x1 = (-b + D**0.5) / (a*2)
  x2 = (-b - D**0.5) / (a*2)
  print("Корни классического квадратного уравнения:")
  print(x1, x2)
if a == 0:
  print("Ваше уравнение выглядит так:")
  print(b1+"*x + "+c1+" = 0")
  x = -c /b1
  print("Корень линейного уравнения:")
  print(x)
if b == 0:
  print("Ваше уравнение выглядит так:")
  print(a1+"*x² + "+c1+" = 0")
  x1 = (-c)**0.5
  x2 = -(-c)**0.5
  print("Корни уравнения выглядят так:")
  print(x1, x2)
if c == 0:
  print("Ваше уравнение выглядит так:")
  print(a1+"*x² + "+b1+"*x = 0")
  x1 = 0
  x2 = -b / a
  print("Корни вашего уравнения выглядят так:")
  print(x1, x2)